let name = prompt(`Як тебе звати?`);
let x = prompt(`Що ви замовили?`);
let num = prompt(`Яка ціна товару?`);
alert(`Привіт, хтось!`);
let nuv = prompt(`Скільки років гарантія?`);
let nun = prompt(`Скільки коштувала гарантія?`);
let nub = prompt(`Скільки її?`);

let nur = prompt(`Скільки коштувала доставка?`);
let suma = nur + num * nub + nun * nub;
console.log(`Вітаю ${name}!Ваше замовлення:

${x} за ціною - ${num}грн у кількості ${nub} штук
Гарантія на ${nuv} рік вартістю - ${nun}грн у кількості ${nub} штук

Вартість доставки - ${nur}грн

прийнято та буде оброблено протягом 24 години.

Загальна вартість замовлення - ${suma}грн`);