let imya prompt(`Як вас називати?`);
let points = 0;
let t = 0;
alert(`Вітаю ${imya}. Це тест по майнкрафту.`);
if(confirm(`Чи планувався розробниками кріпер?`)==false){
	points=points+3
	t++
}
if(confirm(`Чи є у сніговика обличчя за гарбузом?`)==true){
	points++
	t++
}
if(prompt(`Якою мовою розмовляють ендермени в Енді?`)==`англійська задом наперед`){
	points=points+3
	t++
}
if(prompt(`Якого роду корови в майнкрафті, якщо всі вони дають молоко?`)==`жіночого`){
	points++
	t++
}
if(confirm(`Чи можна зробити зі свині свинозомбі?`)==true){
	points++
	t++
}
let al = prompt(`Вкажіть рік коли створилась перша Альфа-версія майнкрафту.`)
if(al==`2009` || al==`2009р` || al==`2009рік` || al==`2009 рік` ){
	points=points+5
	t++
}
if(prompt(`ВВедіть назву бірки, яка перевертає тварин і перекладається як 'Вечерякістка'.`)==`Dinnerbone`){
	points++
	t++
}
let k = prompt(`Що можна використовувати як сміттєвий бак?`);
if(k==`Кактус` || k==`кактус` || k==`блок кактуса`){
	points++
	t++
}

if(confirm(`Чи відрізняється сила і радіус зарядженого і не зарядженого кріпера?`)==true){
	points=points+3
	t++
}
let pop = prompt(`Яка квітка схожа на троянду?`);
if(pop==`кущ троянди` || pop==`мак`){
	points++
	t++
}
let f = 10-t;
	if(points==20){
		alert(`Молодець ${imya}, у тебе ${points} балів з 20, з них ${t} правильних запитань і ${f}, ти знаєш все про майнкрафт.Ти Про!!!(Більше фактів на https://dtf.ru/s/minecraft/73258-46-faktov-o-minecraft)`);
	}else if(points>=10 && points<20){
		alert(`Чудово ${imya}, в тебе ${points} балів з 20, з них ${t} правильних запитань і ${f}, я думаю ти вже грав(ла) в майнкрафт(Більше фактів на https://dtf.ru/s/minecraft/73258-46-faktov-o-minecraft)`);
	}else if(points<=10){
		alert(`Не хочу щоб ти сумував(ла), ${imya}, але в тебе ${points} балів з 20 з них ${t} правильних запитань і ${f}.. я думаю скоро буде краще грай і розвивайся! (Більше фактів на https://dtf.ru/s/minecraft/73258-46-faktov-o-minecraft)`);
	}else if(points==0){
		alert(`${imya}, в тебе ${points} балів з 20 з них ${t} правильних запитань і ${f}.По перше, що ти тут забув(ла)? По друге, скачай майнкрафт і почитай факти(Більше фактів на https://dtf.ru/s/minecraft/73258-46-faktov-o-minecraft)`);	
	}
	